LOad and Inspect Dataset

In [1]:
import pandas as pd

# Load dataset
df = pd.read_csv('../data/producer-prices_npl.csv')

df.head()

,Iso3,StartDate,EndDate,Area Code,Area Code (M49),Area,Item Code,Item Code (CPC),Item,Element Code,Element,Year Code,Year,Months Code,Months,Unit,Value,Flag
0,#country+code,#date+start,#date+end,NaN,NaN,#country+name,#indicator+code,NaN,#indicator+name,NaN,NaN,NaN,#date+year,NaN,NaN,#indicator+type,#indicator+value+num,NaN
1,NPL,1991-01-01,1991-12-31,149.0,'524,Nepal,221,'01371,"Almonds, in shell",5530.0,Producer Price (LCU/tonne),1991.0,1991,7021.0,Annual value,LCU,80291.600000,I
2,NPL,1992-01-01,1992-12-31,149.0,'524,Nepal,221,'01371,"Almonds, in shell",5530.0,Producer Price (LCU/tonne),1992.0,1992,7021.0,Annual value,LCU,67149.300000,I
3,NPL,1993-01-01,1993-12-31,149.0,'524,Nepal,221,'01371,"Almonds, in shell",5530.0,Producer Price (LCU/tonne),1993.0,1993,7021.0,Annual value,LCU,67990.600000,I
4,NPL,1994-01-01,1994-12-31,149.0,'524,Nepal,221,'01371,"Almonds, in shell",5530.0,Producer Price (LCU/tonne),1994.0,1994,7021.0,Annual value,LCU,71168.600000,I

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9421 entries, 0 to 9420
Data columns (total 18 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Iso3             9421 non-null   object
 1   StartDate        9421 non-null   object
 2   EndDate          9421 non-null   object
 3   Area Code        9420 non-null   float64
 4   Area Code (M49)  9420 non-null   object
 5   Area             9421 non-null   object
 6   Item Code        9421 non-null   object
 7   Item Code (CPC)  9420 non-null   object
 8   Item             9421 non-null   object
 9   Element Code     9420 non-null   float64
 10  Element          9420 non-null   object
 11  Year Code        9420 non-null   float64
 12  Year             9421 non-null   object
 13  Months Code      9420 non-null   float64
 14  Months           9420 non-null   object
 15  Unit             6347 non-null   object
 16  Value            9421 non-null   object
 17  Flag             9420 non-null   object
dtypes: float64(4), object(14)
memory usage: 1.3+ MB

In [3]:
df.describe()

       Area Code  Element Code    Year Code  Months Code
count     9420.0   9420.000000  9420.000000       9420.0
mean       149.0   5533.610616  2008.362527       7021.0
std          0.0      3.809841     9.579540          0.0
min        149.0   5530.000000  1991.000000       7021.0
25%        149.0   5531.000000  2000.000000       7021.0
50%        149.0   5532.000000  2009.000000       7021.0
75%        149.0   5539.000000  2017.000000       7021.0
max        149.0   5539.000000  2024.000000       7021.0

In [4]:
df['Item'].unique()[:20]  # See available crops

array(['#indicator+name', 'Almonds, in shell', 'Apples', 'Apricots',
       'Areca nuts', 'Bananas', 'Barley', 'Beans, dry', 'Buckwheat',
       'Cabbages', 'Cauliflowers and broccoli', 'Chick peas, dry',
       'Chillies and peppers, dry (Capsicum spp., Pimenta spp.), raw',
       'Chillies and peppers, green (Capsicum spp. and Pimenta spp.)',
       'Coconuts, in shell', 'Coffee, green', 'Cotton lint, ginned',
       'Cotton seed',
       'Edible roots and tubers with high starch or inulin content, n.e.c., fresh',
       'Eggs from other birds in shell, fresh, n.e.c.'], dtype=object)